In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'Name':['Ali','Ahsan','Hamza','Umer','Ali']
                  , 'Marks':[54,34,np.nan,np.nan,77]
                  ,'Age':(np.random.randint(10,25,size=5))})
np.random.seed(5)

In [3]:
df

    Name  Marks  Age
0    Ali   54.0   15
1  Ahsan   34.0   16
2  Hamza    NaN   12
3   Umer    NaN   15
4    Ali   77.0   24

In [4]:
df.Age.iloc[3]=np.nan

C:\Users\STUDENT\Anaconda3\lib\site-packages\pandas\core\indexing.py:189: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [5]:
df.Age.iloc[1]=np.nan

In [6]:
df

    Name  Marks   Age
0    Ali   54.0  15.0
1  Ahsan   34.0   NaN
2  Hamza    NaN  12.0
3   Umer    NaN   NaN
4    Ali   77.0  24.0

In [7]:
df['Age']=df.Age.fillna(method='ffill')
#second method
#df.Age.fillna(method='ffill',inplace = True)

In [8]:
df

    Name  Marks   Age
0    Ali   54.0  15.0
1  Ahsan   34.0  15.0
2  Hamza    NaN  12.0
3   Umer    NaN  12.0
4    Ali   77.0  24.0

In [9]:
df.duplicated(['Age'])

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [10]:
df01 = df.drop_duplicates('Name',keep='last')
df01

    Name  Marks   Age
1  Ahsan   34.0  15.0
2  Hamza    NaN  12.0
3   Umer    NaN  12.0
4    Ali   77.0  24.0

In [11]:
#del df['Age']

In [12]:
df

    Name  Marks   Age
0    Ali   54.0  15.0
1  Ahsan   34.0  15.0
2  Hamza    NaN  12.0
3   Umer    NaN  12.0
4    Ali   77.0  24.0

In [13]:
#df["Father's Name"] = ['Raza' if x=='Ali' else input(f'Enter Fathers name for {x}:') for x in df['Name'] ]

In [14]:
df['Marks']=df.Marks.fillna(65)

In [15]:
df

    Name  Marks   Age
0    Ali   54.0  15.0
1  Ahsan   34.0  15.0
2  Hamza   65.0  12.0
3   Umer   65.0  12.0
4    Ali   77.0  24.0

In [16]:
df['Name']=df.Name.replace('Ali','Taha')

In [17]:
df

    Name  Marks   Age
0   Taha   54.0  15.0
1  Ahsan   34.0  15.0
2  Hamza   65.0  12.0
3   Umer   65.0  12.0
4   Taha   77.0  24.0

In [18]:
#df.index=df.index.map(lambda i: 'Student '+str(i))
#df

In [26]:
#df.index=['s','p','d','f','g']
df.index=['Student '+str(x) for x in range(len(df))]

In [27]:
df

            Name  Marks   Age
Student 0   Taha   54.0  15.0
Student 1  Ahsan   34.0  15.0
Student 2  Hamza   65.0  12.0
Student 3   Umer   65.0  12.0
Student 4   Taha   77.0  24.0